Ipsitakoley/tm4c129-canbus/busoff/2-interfaces/timers.c
//*****************************************************************************
//
// timers.c - Timers example.
// can.c - Simple CAN example.
//
// Copyright (c) 2013-2017 Texas Instruments Incorporated.  All rights reserved.
// Software License Agreement
// 
// Texas Instruments (TI) is supplying this software for use solely and
// exclusively on TI's microcontroller products. The software is owned by
// TI and/or its suppliers, and is protected under applicable copyright
// laws. You may not combine this software with "viral" open-source
// software in order to form a larger program.
// 
// THIS SOFTWARE IS PROVIDED "AS IS" AND WITH ALL FAULTS.
// NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT
// NOT LIMITED TO, IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
// A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE. TI SHALL NOT, UNDER ANY
// CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR CONSEQUENTIAL
// DAMAGES, FOR ANY REASON WHATSOEVER.
// 
// This is part of revision 2.1.4.178 of the EK-TM4C129EXL Firmware Package.
// This is part of revision 2.1.4.178 of the DK-TM4C123G Firmware Package.
//
//*****************************************************************************

#include <stdint.h>
#include <stdbool.h>
#include "inc/hw_can.h"
#include "inc/hw_ints.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "driverlib/debug.h"
#include "driverlib/fpu.h"
#include "driverlib/can.h"
#include "driverlib/gpio.h"
#include "driverlib/interrupt.h"
#include "driverlib/pin_map.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "driverlib/sysctl.h"
#include "driverlib/timer.h"


//*****************************************************************************
//
// A counter that keeps track of the number of times the TX & RX interrupt has
// occurred, which should match the number of messages that were transmitted /
// received.
//
//*****************************************************************************
volatile uint32_t g_ui32RXMsgCount = 0;
volatile uint32_t g_ui32TXMsgCount = 0;
volatile uint32_t g_ui32TXHighMsgCount = 0;
volatile uint32_t g_ui32TXMidMsgCount = 0;

volatile uint32_t g_ui32TXCount = 0;
volatile uint32_t g_ui32RXCount = 0;

//*****************************************************************************
//
// A flag for the interrupt handler to indicate that a message was received.
//
//*****************************************************************************
volatile bool g_bRXFlag = 0;

volatile bool g_started = 0;

volatile bool g_epass = false;

volatile bool g_tick = false;

volatile uint8_t g_sync = 1;
volatile uint8_t g_parity = 0;



//*****************************************************************************
//
// A global to keep track of the error flags that have been thrown so they may
// be processed. This is necessary because reading the error register clears
// the flags, so it is necessary to save them somewhere for processing.
//
//*****************************************************************************
volatile uint32_t g_ui32ErrFlag = 0;
volatile uint32_t g_ui32ErrFlag_1 = 0;
//*****************************************************************************
//
// CAN message Objects for data being sent / received
//
//*****************************************************************************
tCANMsgObject g_sCAN0RxMessage;
tCANMsgObject g_sCAN0TxMessage;
tCANMsgObject g_sCAN0TxMessageHigh;
tCANMsgObject g_sCAN0TxMessageAttack1_10;
tCANMsgObject g_sCAN0TxMessageSpoof1_10;
tCANMsgObject g_sCAN0TxMessageSpoof1_100;
tCANMsgObject g_sCAN0TxMessageSpoof1_1000;
tCANMsgObject g_sCAN0TxMessageAttack2_5;
tCANMsgObject g_sCAN0TxMessageSpoof2_5;
tCANMsgObject g_sCAN0TxMessageSpoof2_10;
tCANMsgObject g_sCAN0TxMessageMid;

//*****************************************************************************
//
// Message Identifiers and Objects
//
//*****************************************************************************

#define RXOBJECT             10
#define TXHIGHOBJECT         2
#define TXSPOOFOBJECT2_5     3
#define TXMIDOBJECT          4
#define TXATKOBJECT1         5
#define TXATKOBJECT2         6
#define TXSPOOFOBJECT1_100   7
#define TXOBJECT             8
#define TXSPOOFOBJECT1_1000  9


#define TXSPOOFOBJECT1_10   TXATKOBJECT1
#define TXSPOOFOBJECT2_10    TXATKOBJECT2
//---------


#define ATK1_ID 0xB2
#define ATK1_LEN (1)
uint8_t g_ui8TXMsgDataAttack1[ATK1_LEN] = {0xA6};

#define SPOOFID1_10         ATK1_ID
#define SPOOFID1_10_LEN     ATK1_LEN
uint8_t g_ui8TXMsgDataSpoof1_10[SPOOFID1_10_LEN] = {0x86};

#define SPOOFID1_100    0xC2
#define SPOOFID1_100_LEN (4)
uint8_t g_ui8TXMsgDataSpoof1_100[SPOOFID1_100_LEN] = {0x24,0x33,0x41,0xA2};

#define SPOOFID1_1000   0xD2
#define SPOOFID1_1000_LEN (3)
uint8_t g_ui8TXMsgDataSpoof1_1000[SPOOFID1_1000_LEN] = {0xB0,0xB2,0xB4};

//----------
#define ATK2_ID 0xB3
#define ATK2_LEN (2)
uint8_t g_ui8TXMsgDataAttack2[ATK2_LEN] = { 0xE0, 0x2B };

#define SPOOFID2_5          0xA3
#define SPOOFID2_5_LEN (1)
uint8_t g_ui8TXMsgDataSpoof2_5[SPOOFID2_5_LEN] = {0x42};

#define SPOOFID2_10         ATK2_ID
#define SPOOFID2_10_LEN     ATK2_LEN
uint8_t g_ui8TXMsgDataSpoof2_10[SPOOFID2_10_LEN] = { 0xA0, 0x2B };



#define BITRATE (250000)

#define GENERATE_PRECEDED_MSG   0

#define ATKMSGCOUNT (-1)
#define ATKDELAY(_n) (_n*200)

#define INTERVAL (600000) /* 5 ms */
#define DIFFERENCE ((44*120000)/(BITRATE/1000)) /* approximately 1 1-byte message transmission time */

#define ATK1_DIFFERENCE (0 - 2*DIFFERENCE)


#define ATK1_START (ATKDELAY(2))
#define ATK1_END (ATK1_START + 10000)


//*****************************************************************************
//
// Variables to hold character being sent / reveived
//
//*****************************************************************************
uint8_t g_ui8TXMsgData;
uint8_t g_ui8TXMsgDataHigh[2] = { 0x11, 0x36 };
uint8_t g_ui8TXMsgDataMid[6] = { 0xAF, 0xBC, 0x11, 0x3D, 0xF0, 0x66 };
uint8_t g_ui8RXMsgData[8];

volatile uint32_t g_x;
volatile uint32_t g_y;

//*****************************************************************************
//
// CAN 0 Interrupt Handler. It checks for the cause of the interrupt, and
// maintains a count of all messages that have been transmitted / received
//
//*****************************************************************************
void
CAN0IntHandler(void)
{
    uint32_t ui32Status;

