Ipsitakoley/tm4c129-canbus/busoff/2-interfaces/timers.c
    ROM_IntMasterDisable();

    //
    // Read the CAN interrupt status to find the cause of the interrupt
    //
    // CAN_INT_STS_CAUSE register values
    // 0x0000        = No Interrupt Pending
    // 0x0001-0x0020 = Number of message object that caused the interrupt
    // 0x8000        = Status interrupt
    // all other numbers are reserved and have no meaning in this system
    //
    ui32Status = CANIntStatus(CAN0_BASE, CAN_INT_STS_CAUSE);

    //
    // If this was a status interrupt acknowledge it by reading the CAN
    // controller status register.
    //
    if(ui32Status == CAN_INT_INTID_STATUS)
    {
        //
        // Read the controller status.  This will return a field of status
        // error bits that can indicate various errors. Refer to the
        // API documentation for details about the error status bits.
        // The act of reading this status will clear the interrupt.
        //
        ui32Status = CANStatusGet(CAN0_BASE, CAN_STS_CONTROL);

        //
        // Add ERROR flags to list of current errors. To be handled
        // later, because it would take too much time here in the
        // interrupt.
        //
        g_ui32ErrFlag |= ui32Status;
    }

    //
    // Check if the cause is message object RXOBJECT, which we are using
    // for receiving messages.
    //
    else if(ui32Status == RXOBJECT)
    {
        if ( g_sync == 1 ) {
            // TODO: Read timer and send messages?

            //TimerDisable(TIMER0_BASE, TIMER_A); /* turn off normal mode */
            TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL+ATK1_DIFFERENCE);
            //TimerEnable(TIMER1_BASE, TIMER_A);  /* start attack mode! */
            g_sync = 2;
            g_ui32RXMsgCount = g_ui32TXCount;

            /* Change the CAN Message ID to observe */
            //g_sCAN0RxMessage.ui32MsgID = VICTIMID;
            //CANMessageSet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, MSG_OBJ_TYPE_RX);
        }

        CANIntClear(CAN0_BASE, RXOBJECT);

        g_bRXFlag = true;

        g_ui32ErrFlag = 0;
    }

#if 0
    else if(ui32Status == TXOBJECT)
    {
        //
        // Getting to this point means that the TX interrupt occurred on
        // message object TXOBJECT, and the message reception is complete.
        // Clear the message object interrupt.
        //
        CANIntClear(CAN0_BASE, TXOBJECT);

        //
        // Increment a counter to keep track of how many messages have been
        // transmitted. In a real application this could be used to set
        // flags to indicate when a message is transmitted.
        //
        g_ui32TXMsgCount++;

        //
        // Since a message was transmitted, clear any error flags.
        // This is done because before the message is transmitted it triggers
        // a Status Interrupt for TX complete. by clearing the flag here we
        // prevent unnecessary error handling from happeneing
        //
        g_ui32ErrFlag = 0;
    }
    else if (ui32Status == TXMIDOBJECT) {
            CANIntClear(CAN0_BASE, TXMIDOBJECT);
            g_ui32TXMidMsgCount++;
            g_ui32ErrFlag = 0;
        }
    else if (ui32Status == TXHIGHOBJECT) {
        CANIntClear(CAN0_BASE, TXHIGHOBJECT);
        g_ui32TXHighMsgCount++;
        g_ui32ErrFlag = 0;
    }
    else if (ui32Status == TXATKOBJECT1) {
        CANIntClear(CAN0_BASE, TXATKOBJECT1);
        g_ui32ErrFlag = 0;
    }
    else if (ui32Status == TXATKOBJECT2) {
        CANIntClear(CAN0_BASE, TXATKOBJECT2);
        g_ui32ErrFlag = 0;
    }
#endif

    else
    {
        CANIntClear(CAN0_BASE, ui32Status);
        g_ui32ErrFlag = 0;
    }
    ROM_IntMasterEnable();
}

void
CAN1IntHandler(void)
{
    uint32_t ui32Status;

    ROM_IntMasterDisable();

    ui32Status = CANIntStatus(CAN1_BASE, CAN_INT_STS_CAUSE);
    if(ui32Status == CAN_INT_INTID_STATUS)
    {
        ui32Status = CANStatusGet(CAN1_BASE, CAN_STS_CONTROL);
        g_ui32ErrFlag_1 |= ui32Status;
    } else if(ui32Status == TXATKOBJECT1)
    {
        CANIntClear(CAN1_BASE, TXATKOBJECT1);
        g_ui32ErrFlag_1 = 0;
    }
    else
    {
        CANIntClear(CAN1_BASE, ui32Status);
        g_ui32ErrFlag_1 = 0;
    }
    ROM_IntMasterEnable();
}


//****************************************************************************
//
// System clock rate in Hz.
//
//****************************************************************************
uint32_t g_ui32SysClock;

//*****************************************************************************
//
// Flags that contain the current value of the interrupt indicator as displayed
// on the UART.
//
//*****************************************************************************
uint32_t g_ui32Flags;

//*****************************************************************************
//
// The error routine that is called if the driver library encounters an error.
//
//*****************************************************************************
#ifdef DEBUG
void
__error__(char *pcFilename, uint32_t ui32Line)
{
}
#endif

void
send_messages(int count)
{

    CANMessageSet(CAN0_BASE, TXHIGHOBJECT, &g_sCAN0TxMessageHigh,
                  MSG_OBJ_TYPE_TX);

    if ( count % 2 == 0 ) {
        CANMessageSet(CAN0_BASE, TXMIDOBJECT, &g_sCAN0TxMessageMid,
                  MSG_OBJ_TYPE_TX);
    }

    if ( count % 200 == 0 ) {
        CANMessageSet(CAN0_BASE, TXOBJECT, &g_sCAN0TxMessage,
                  MSG_OBJ_TYPE_TX);

        HWREGBITW(&g_ui32Flags, 0) ^= 1;
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, g_ui32Flags);
    }
}

void
attack_messages_1(int count, int parity) {
    CANMessageSet(CAN0_BASE, TXHIGHOBJECT, &g_sCAN0TxMessageHigh,
                  MSG_OBJ_TYPE_TX);

    if ( count % 2 == parity ) {
        CANMessageSet(CAN1_BASE, TXATKOBJECT1, &g_sCAN0TxMessageAttack1_10,
              MSG_OBJ_TYPE_TX); /* Attack Msg */

        CANMessageSet(CAN0_BASE, TXMIDOBJECT, &g_sCAN0TxMessageMid,
                  MSG_OBJ_TYPE_TX);
    }

