Ipsitakoley/tm4c129-canbus/busoff/2-interfaces/timers.c
    IntEnable(INT_TIMER0A);
    TimerIntEnable(TIMER0_BASE, TIMER_TIMA_TIMEOUT);
//    IntEnable(INT_TIMER1A);
//    TimerIntEnable(TIMER1_BASE, TIMER_TIMA_TIMEOUT);

    InitCAN0();
    InitCAN1();

    ROM_TimerEnable(TIMER0_BASE, TIMER_A);
    //ROM_TimerEnable(TIMER1_BASE, TIMER_A);

    //
    // Loop forever while the timers run.
    //
    while(1)
    {
        if( g_tick == true ) {
            g_tick = false;

            count++;

            if ( count % 200 == 0 ) {
                if ( g_epass == true ) {
                    GPIOPinWrite(GPIO_PORTF_BASE, GPIO_PIN_4, 0);
                    g_epass = false;
                }
                g_sync = 1;
            }

            /* attack! */
            if ( count < ATK1_START ) {
                send_messages(count);
            } else if ( count >= ATK1_START && count <= ATK1_END ) {
                attack_messages_1(count, g_parity);

        #if GENERATE_PRECEDED_MSG
                CANMessageSet(CAN0_BASE, TXHIGHOBJECT, &g_sCAN0TxMessageHigh,
                              MSG_OBJ_TYPE_TX); /* Preceded Msg */
        #endif
                // CANMessageSet(CAN0_BASE, TXATKOBJECTHIGH, &g_sCAN0TxMessageAttackMid2, MSG_OBJ_TYPE_TX);

                // Step 1: Compromise Victim 1

                // TODO: read own TEC to detect when victim should be in passive state, when attacker has recovered enough for step 2

                // TODO: Step 2: begin spoofing victim 1, Reprogram RXOBJECT to sync with second victim, and attack it.
            } else {
                send_messages(count);
                spoof_messages_1(count);
            }
        }

        //
        // If the flag is set, that means that the RX interrupt occurred and
        // there is a message ready to be read from the CAN
        //
        if(g_bRXFlag)
        {
            //
            // Reuse the same message object that was used earlier to configure
            // the CAN for receiving messages.  A buffer for storing the
            // received data must also be provided, so set the buffer pointer
            // within the message object.
            //
            g_sCAN0RxMessage.pui8MsgData = (uint8_t *) &g_ui8RXMsgData;

            //
            // Read the message from the CAN.  Message object RXOBJECT is used
            // (which is not the same thing as CAN ID).  The interrupt clearing
            // flag is not set because this interrupt was already cleared in
            // the interrupt handler.
            //
            CANMessageGet(CAN0_BASE, RXOBJECT, &g_sCAN0RxMessage, 0);

            //
            // Clear the pending message flag so that the interrupt handler can
            // set it again when the next message arrives.
            //
            g_bRXFlag = 0;

            //
            // Check to see if there is an indication that some messages were
            // lost.
            //
            if(g_sCAN0RxMessage.ui32Flags & MSG_OBJ_DATA_LOST)
            {
            //    UARTprintf("\nCAN message loss detected\n");
            }

            //
            // Print the received character to the UART terminal
            //
//            UARTprintf("%c", g_ui8RXMsgData);

        }
        if (g_ui32ErrFlag) {
            CANErrorHandler();
        }

    }
}
